In [20]:
import numpy as np
import pandas as pd

In [21]:
tr_payment = pd.read_csv('./Data/train_payment.csv')
t1_payment = pd.read_csv('./Data/test1_payment.csv')
t2_payment = pd.read_csv('./Data/test2_payment.csv')

In [22]:
print(tr_payment.shape)
tr_payment.head()

(66432, 3)

   day  acc_id  amount_spent
0   18   27835      0.826123
1   23   27835      0.011735
2   27   27835      0.035204
3   17   12351      0.528062
4   11  125437      0.633674

In [23]:
print(t1_payment.shape)
t1_payment.head()

(24829, 3)

   day  acc_id  amount_spent
0   15    4617      0.621939
1   16    4617      2.675512
2   17    4617      0.211225
3   18    4617      0.246429
4   22    4617      1.196940

In [24]:
print(t2_payment.shape)
t2_payment.head()

(25630, 3)

   day  acc_id  amount_spent
0   23   93509      0.674745
1   26   93509      0.176021
2    8   14183      0.585562
3    9   14183      0.234694
4   10   14183      1.760205

In [25]:
tr_payment = tr_payment.rename(columns = {'amount_spent' : 'payment_amount_spent'})
t1_payment = t1_payment.rename(columns = {'amount_spent' : 'payment_amount_spent'})
t2_payment = t2_payment.rename(columns = {'amount_spent' : 'payment_amount_spent'})

In [26]:
tr_payment['count'] = 0
t1_payment['count'] = 0
t2_payment['count'] = 0

In [28]:
for acc in tr_payment.acc_id.unique():
    tr_payment.loc[tr_payment.acc_id == acc, 'payment_amount_spent'] = tr_payment.loc[tr_payment.acc_id == acc, 'payment_amount_spent'].sum()
    tr_payment.loc[tr_payment.acc_id == acc, 'count'] = tr_payment.loc[tr_payment.acc_id == acc, 'count'].count()
print('tr_payment complete')

for acc in t1_payment.acc_id.unique():
    t1_payment.loc[t1_payment.acc_id == acc, 'payment_amount_spent'] = t1_payment.loc[t1_payment.acc_id == acc, 'payment_amount_spent'].sum()
    t1_payment.loc[t1_payment.acc_id == acc, 'count'] = t1_payment.loc[t1_payment.acc_id == acc, 'count'].count()
print('t1_payment complete')

for acc in t2_payment.acc_id.unique():
    t2_payment.loc[t2_payment.acc_id == acc, 'payment_amount_spent'] = t2_payment.loc[t2_payment.acc_id == acc, 'payment_amount_spent'].sum()
    t2_payment.loc[t2_payment.acc_id == acc, 'count'] = t2_payment.loc[t2_payment.acc_id == acc, 'count'].count()
print('t2_payment complete')

tr_payment complete
t1_payment complete
t2_payment complete

In [29]:
tr_payment = tr_payment.drop('day', axis = 1)
t1_payment = t1_payment.drop('day', axis = 1)
t2_payment = t2_payment.drop('day', axis = 1)

In [30]:
tr_payment = tr_payment.drop_duplicates()
t1_payment = t1_payment.drop_duplicates()
t2_payment = t2_payment.drop_duplicates()

In [31]:
tr_payment.to_csv('./input/EDA(1)_train_payment.csv', index = False)
t1_payment.to_csv('./input/EDA(1)_test1_payment.csv', index = False)
t2_payment.to_csv('./input/EDA(1)_test2_payment.csv', index = False)

In [32]:
tr_payment.head()

   acc_id  payment_amount_spent  count
0   27835              2.619185      3
3   12351              0.528062      1
4  125437              5.446075      3
7  104483              0.371990      1
8    4704              1.404644      1

In [33]:
t1_payment.head()

    acc_id  payment_amount_spent  count
0     4617              5.279442      8
8    31072              0.924694      3
11   19942              1.999593      2
13   74560              0.363776      2
15  109638              0.524541      2

In [34]:
t2_payment.head()

    acc_id  payment_amount_spent  count
0    93509              0.850766      2
2    14183              7.103015     10
12  129759              4.258523      5
17  129209              0.826123      1
18   52886              0.743980      2